# todo: Заданы три числа в переменных x, y, z.
# Напечатать наибольшее из этих чисел.
# Пример:
# x = 10
# y = 15
# z = 2
# Ответ:
# Наибольшее число 15
# Пример:
# x = 77
# y = 9
# z = 130
# Ответ:
# Наибольшее число 130
# Задачу решить без функций max и прочих.

def max_value(x, y, z):
  my_tuple = (x, y, z)
  n = my_tuple[0]

  for i in my_tuple:
    if n < i:
      n = i
  return n


x = 10
y = 15
z = 2
print("Наибольшее число: ", max_value(x, y, z))

x = 77
y = 9
z = 130
print("Наибольшее число: ", max_value(x, y, z))