#todo: Написать программу, которая считывает два числа и выводит их сумму, разность,частное, произведение,
# результат целочисленного деления, результат деления с остатком, результат возведения в степень.
num1 = int(input("Введите превое число: "))
num2 = int(input("Введите второе число: "))

print("Сумма: " + str(num1 + num2))
print("Разность: " + str(num1 - num2))
print("Частное: " + str(num1 / num2))
print("Произведение: " + str(num1 * num2))
print("Целочисленное деление: " + str(num1 // num2))
print("Деление с остатком: " + str(num1 % num2))
print("Возведение в степень: " + str(num1 ** num2))