# В восточном календаре принят 60-летний цикл, состоящий из 12- летних подциклов,
# обозначаемых названиями цвета: зеленый, красный, желтый, белый и черный.
# В каждом подцикле годы носят названия животных: крысы, коровы, тигра, зайца, дракона,
# змеи, лошади, овцы, обезьяны, курицы, собаки и свиньи. По номеру года вывести его название,
# если 1984 год был началом цикла — годом зеленой крысы.

colors = ['белый', 'черный', 'зеленый', 'красный', 'желтый']
years_animals = ['крыса', 'бык', 'тигр', "заяц", 'дракон', 'змея', 'лошадь', 'овца', 'обезьяна', 'курица', 'собака', 'свинья']
start_year = 1900

year = int(input(f"Введите год (от {start_year}): "))

index_year_animal = (year - start_year) % 12
index_year_color = (year - start_year) % 10 // 2


print(f'{year} - {colors[index_year_color]} {years_animals[index_year_animal]}')